import pandas as pd

Train = [("「東海道　京都之内」「大内能上覧図」", {"entities": [(1, 4, "PLACE"), (5, 7, "PLACE")]}),
         ("「東海道　京都名所之内」「四条河原」", {"entities": [(1, 4, "PLACE"), (5, 7, "PLACE"), (13, 17, "PLACE")]}),
         ("「東海道名所之内」「御能拝見之図」", {"entities": [(1, 4, "PLACE")]}),
         ("「東海道」「京都  紫震殿」", {"entities": [(1, 4, "PLACE"), (6, 8, "PLACE"), (9, 12, "PLACE")]}),
         ("「東海道之内」「京都参内」", {"entities": [(1, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「東海道之内」「京」「大内蹴鞠之遊覧」", {"entities": [(1, 4, "PLACE"), (8, 9, "PLACE"), (11, 13, "PLACE")]}),
         ("「東海道名所之内」「上加茂」「岩本社」「三本杉」「片岡社」「楼門」「御供所」「若宮」「別雷皇太神宮」「杉尾社」「仮殿」", {
             "entities": [(1, 4, "PLACE"), (10, 13, "PLACE"), (15, 18, "PLACE"), (20, 23, "PLACE"), (25, 28, "PLACE"),
                          (30, 32, "PLACE"), (34, 37, "PLACE"), (39, 41, "PLACE"), (43, 49, "PLACE"), (51, 54, "PLACE"),
                          (56, 58, "PLACE")]}),
         ("「東海道名所之内」「京加茂」「山科」「黒谷」「吉田山」「将軍塚」「比叡山」「比良」", {
             "entities": [(1, 4, "PLACE"), (10, 13, "PLACE"), (15, 17, "PLACE"), (19, 21, "PLACE"), (23, 26, "PLACE"),
                          (28, 31, "PLACE"), (33, 36, "PLACE"), (38, 40, "PLACE")]}),
         ("「東海道名所之内」「加茂の競馬」", {"entities": [(1, 4, "PLACE"), (10, 12, "PLACE")]}),
         ("「東海道名所之内」「糺河原」「糺川原」「みたらし川」「河合社」",
          {"entities": [(1, 4, "PLACE"), (10, 13, "PLACE"), (15, 18, "PLACE"), (20, 25, "PLACE"), (27, 30, "PLACE")]}),
         ("「東海道名所之内」「祇園祭礼」", {"entities": [(1, 4, "PLACE"), (10, 12, "PLACE")]}),
         ("「東海道 京都名所之内」「島原」", {"entities": [(1, 4, "PLACE"), (5, 7, "PLACE"), (13, 15, "PLACE")]}),
         ("「東海道名所」「京洛中ノ内」「五条橋」", {"entities": [(1, 4, "PLACE"), (8, 10, "PLACE"), (15, 18, "PLACE")]}),
         ("「東海道名所之内」「京都等持院足利十五代木像之図」",
          {"entities": [(1, 4, "PLACE"), (10, 15, "PLACE"), (12, 15, "PLACE")]}),
         ("「東海道名所つゝき」「羅生門之古図」「春雨ノ社」「金札石刀石トモ云」「鬼カミノハシラ」",
          {"entities": [(1, 4, "PLACE"), (11, 14, "PLACE"), (19, 23, "PLACE")]}),
         ("「東海道之内」「京都御出立」", {"entities": [(1, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「東海道名所之内」「下加茂」「☆☆との」「いのうへ社」「二言社」「御供所」「本社御租神」「石☆社」", {
             "entities": [(1, 4, "PLACE"), (10, 13, "PLACE"), (21, 26, "PLACE"), (28, 31, "PLACE"), (33, 36, "PLACE"),
                          (38, 43, "PLACE"), (45, 48, "PLACE")]}),
         ("「東海道名所之内」「宇治」", {"entities": [(1, 4, "PLACE"), (10, 12, "PLACE")]}),
         ("「二見浦」", {"entities": [(1, 4, "PLACE")]}),
         ("「長谷川貞信筆　都名所写真鏡　上篇」", {"entities": [(7, 8, "PLACE")]}),
         ("「都名所之内」「広沢池秋の月」「遍照寺山」「いけ浦」「愛宕山」",
          {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (16, 20, "PLACE"), (22, 25, "PLACE"), (27, 30, "PLACE")]}),
         ("「都名所之内」「知恩院本堂に傘を見る", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「伏見稲荷社」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「高台寺秋ノ景」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「東福寺通天橋」", {"entities": [(1, 2, "PLACE"), (8, 14, "PLACE")]}),
         ("「都名所之内」「西大谷目鏡橋」", {"entities": [(1, 2, "PLACE"), (8, 14, "PLACE")]}),
         ("「都名所之内」「音羽山清水寺」", {"entities": [(1, 2, "PLACE"), (8, 14, "PLACE")]}),
         ("「都名所之内」「栂尾門前雨中」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「祇園大鳥居」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「三条大はし」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「竜安寺雪曙」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         (
         "「都名所之内」「四条橋より縄手通大和橋を望」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (13, 19, "PLACE")]}),
         ("「都名所之内」「如意嶽大文字」", {"entities": [(1, 2, "PLACE"), (8, 14, "PLACE")]}),
         ("「都名所之内」「比叡山山上より湖水を望」「三上山」",
          {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (21, 24, "PLACE")]}),
         ("「都名所之内」「三条大はし」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「北野天満宮境内」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「金閣寺雪景」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「妙心寺雪江松」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「竜安寺雪曙」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「御室仁和寺花盛」", {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE")]}),
         ("「都名所之内」「広沢池秋の月」「遍照寺山」「いけ浦」",
          {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (16, 20, "PLACE"), (22, 25, "PLACE")]}),
         ("「都名所之内」「広沢池秋の月」「遍照寺山」「いけ浦」「愛宕山」",
          {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (16, 20, "PLACE"), (22, 25, "PLACE"), (27, 30, "PLACE")]}),
         ("「都名所之内」「高雄奥の院庭中」「清滝川」", {"entities": [(1, 2, "PLACE"), (8, 10, "PLACE"), (17, 20, "PLACE")]}),
         ("「都名所之内」「栂尾門前雨中」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE")]}),
         ("「都名所之内」「愛宕山之図」「清滝川」", {"entities": [(1, 2, "PLACE"), (8, 11, "PLACE"), (15, 18, "PLACE")]}),
         ("「都名所之内」「嵐山三軒家より眺望」「となせの滝」",
          {"entities": [(1, 2, "PLACE"), (8, 13, "PLACE"), (19, 24, "PLACE")]}),
         ("「都名所之内」「島原出口光景」", {"entities": [(1, 2, "PLACE"), (8, 10, "PLACE")]}),
         ("「都名所之内」「島原出口光景」", {"entities": [(1, 2, "PLACE"), (8, 10, "PLACE")]}),
         ("「京都名所之内」「金閣寺」", {"entities": [(1, 2, "PLACE"), (9, 12, "PLACE")]}),
         ("「滑稽都名所」「三十三間堂」", {"entities": [(3, 4, "PLACE"), (8, 13, "PLACE")]}),
         ("「滑稽都名所」「黒谷」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「銀閣寺」", {"entities": [(3, 4, "PLACE"), (8, 11, "PLACE")]}),
         ("「滑稽都名所」「耳塚」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「東寺」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「真葛原」", {"entities": [(3, 4, "PLACE"), (8, 11, "PLACE")]}),
         ("「滑稽都名所」「内裏」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「大仏」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「平野」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「鞍馬山」", {"entities": [(3, 4, "PLACE"), (8, 11, "PLACE")]}),
         ("「滑稽都名所」「広沢」", {"entities": [(3, 4, "PLACE"), (8, 10, "PLACE")]}),
         ("「滑稽都名所」「竜安寺」", {"entities": [(3, 4, "PLACE"), (8, 11, "PLACE")]}),
         ("「諸国名所百景」「京都祇園祭礼」", {"entities": [(9, 11, "PLACE")]}),
         ("「京洛名所」「二条橋より大文字を望む」", {"entities": [(1, 3, "PLACE"), (7, 10, "PLACE"), (12, 15, "PLACE")]}),
         ("「東福寺通天橋」", {"entities": [(1, 7, "PLACE")]}),
         ("「祇園春宵」", {"entities": [(1, 3, "PLACE")]}),
         ("「京都大仏殿大鐘楼」", {"entities": [(1, 9, "PLACE")]}),
         ("「大文字山」", {"entities": [(1, 5, "PLACE")]}),
         ("「銀閣寺新緑」", {"entities": [(1, 4, "PLACE")]}),
         ("「島原大門出口ノ柳」", {"entities": [(1, 5, "PLACE")]}),
         ("「三十三間堂」", {"entities": [(1, 6, "PLACE")]}),
         ("「嵐山渡月橋の夏雨」", {"entities": [(1, 6, "PLACE")]}),
         ("「清水寺秋色」", {"entities": [(1, 4, "PLACE")]}),
         ("「平安　諸大家名所画譜", {"entities": [(1, 3, "PLACE")]}),
         ("「京都諸大家筆　平安諸大家名所画譜目録」", {"entities": [(1, 3, "PLACE"), (7, 9, "PLACE")]}),
         ("「平安諸大家名所画譜一」「第一応挙筆宇治橋之図」", {"entities": [(1, 3, "PLACE"), (18, 21, "PLACE")]}),
         ("「平安諸大家名所画譜ニ」「第二景文筆鳳凰堂之図」", {"entities": [(1, 3, "PLACE"), (18, 21, "PLACE")]}),
         ("「江戸名所百人美女」「するがだい」", {"entities": [(1, 3, "PLACE"), (11, 16, "PLACE")]}),
         ("「江戸名所百人美女日本はし」", {"entities": [(1, 3, "PLACE"), (9, 13, "PLACE")]}),
         ("「江戸名所百人美女」  「柳はし」", {"entities": [(1, 3, "PLACE"), (11, 14, "PLACE")]}),
         ("「江戸名所百人美女」「鎧のわたし」", {"entities": [(1, 3, "PLACE"), (11, 16, "PLACE")]}),
         ("「江戸名所道戯盡」「二」「両国の夕立」", {"entities": [(1, 3, "PLACE"), (13, 15, "PLACE")]}),
         ("「江戸名所道戯盡」「四」「御茶の水の釣人」", {"entities": [(1, 3, "PLACE"), (13, 17, "PLACE")]}),
         ("「江戸名所道戯盡」「五」「飛鳥山の花見」", {"entities": [(1, 3, "PLACE"), (13, 15, "PLACE")]}),
         ("「江戸名所道外盡」「六」「不忍池」", {"entities": [(1, 3, "PLACE"), (13, 16, "PLACE")]}),
         ("「江戸名所道化盡」「七」「新シ橋の大風」", {"entities": [(1, 3, "PLACE"), (13, 16, "PLACE")]}),
         ("「江戸名所道外盡」「八」「隅田堤の弥生」", {"entities": [(1, 3, "PLACE"), (13, 16, "PLACE")]}),
         ("「江戸名所道化盡」「九」「湯嶋天神の臺」", {"entities": [(1, 3, "PLACE"), (13, 17, "PLACE")]}),
         ("「江戸名所道外尽」「十」「外神田佐久間町」", {"entities": [(1, 3, "PLACE"), (13, 20, "PLACE")]}),
         ("「江戸名所道戯盡」「十三」「鎧のわたし七夕祭」", {"entities": [(1, 3, "PLACE"), (14, 19, "PLACE")]}),
         ("「江戸名所道戯盡」「十四」「芝赤羽はしの雪中」", {"entities": [(1, 3, "PLACE"), (14, 19, "PLACE")]}),
         ("「江戸名所道戯盡」「十六」「王子狐火」", {"entities": [(1, 3, "PLACE")]}),
         ("「江戸名所道化盡」「十七」「通壹丁目祇園會」", {"entities": [(1, 3, "PLACE"), (14, 20, "PLACE")]}),
         ("「江戸名所道外盡」「二十」「道灌山虫聞」", {"entities": [(1, 3, "PLACE"), (14, 17, "PLACE")]}),
         ("「江戸名所道外盡」「廿四」「数寄屋かし」", {"entities": [(1, 3, "PLACE"), (14, 19, "PLACE")]}),
         ("「江戸名所道戯盡」「三十五」「吾嬬の森梅見もとり」", {"entities": [(1, 3, "PLACE"), (14, 17, "PLACE")]}),
         ("「江戸名所張交図會」「浅草金龍山」「三囲」「雷門」「すみた川」「向嶋花屋鋪」", {
             "entities": [(1, 3, "PLACE"), (11, 16, "PLACE"), (18, 20, "PLACE"), (22, 24, "PLACE"), (26, 30, "PLACE"),
                          (32, 37, "PLACE")]}),
         ("「江戸廼花名勝會」「五番組」「ま」「赤坂」「赤坂奴凧平　尾上多見蔵」「赤坂御門外」",
          {"entities": [(1, 3, "PLACE"), (18, 20, "PLACE"), (22, 24, "PLACE"), (35, 37, "PLACE")]}),
         ("「江戸の華名勝會」「五番組」「ま」「三河臺」「三河臺　氷川神社」「関東小六　市川市蔵」",
          {"entities": [(1, 3, "PLACE"), (18, 21, "PLACE"), (23, 26, "PLACE"), (27, 31, "PLACE")]}),
         ("「東京名所四十八景　日本はし夕けしき」", {"entities": [(1, 3, "PLACE"), (10, 14, "PLACE")]}),
         ("「東京名所四十八景」「神田明神社内年の市」",
          {"entities": [(1, 3, "PLACE"), (11, 16, "PLACE"), (16, 20, "PLACE")]}),
         ("「東京名所四十八景　谷中諏訪の社廿六夜まち」", {"entities": [(1, 3, "PLACE"), (12, 16, "PLACE")]})
         ]

Test = [("「東海道五十三次」  「三十八」「藤川」", {"entities": [(1, 4, "PLACE"), (17, 19, "PLACE")]}),
        ("「東都六玉顔ノ内」  「角田川」", {"entities": [(1, 3, "PLACE"), (12, 15, "PLACE")]}),
        ("「名所江戸百景」  「猿わか町よるの景」", {"entities": [(3, 5, "PLACE"), (11, 15, "PLACE")]}),
        ("「江戸名所図会」  「卅二」「三十三間堂」「曽我五郎時宗」", {"entities": [(1, 3, "PLACE"), (15, 20, "PLACE")]}),
        ("「江戸名所　百人美女」  「今川はし」", {"entities": [(1, 3, "PLACE"), (14, 18, "PLACE")]}),
        (" 「東海道五十三次の内」  「戸塚藤沢間」「吉田橋」「松若」",
         {"entities": [(2, 4, "PLACE"), (15, 19, "PLACE"), (22, 25, "PLACE"), (27, 29, "PLACE")]}),
        (" 「江戸名所百人美女」  「今戸」", {"entities": [(2, 4, "PLACE"), (14, 16, "PLACE")]}),
        ("「東都高名会席尽」  「金子」「助六」", {"entities": [(1, 3, "PLACE")]}),
        (" 「木曽六十九駅」  「草津」「野路玉川」「清玄尼」",
         {"entities": [(2, 4, "PLACE"), (12, 14, "PLACE"), (16, 20, "PLACE")]}),
        (" 「東海道」 「程ケ谷戸塚間」「権太坂」「いがみ」", {"entities": [(2, 5, "PLACE"), (8, 13, "PLACE"), (16, 19, "PLACE")]}),
        (" 「両国夕景一ツ目千金」", {"entities": [(2, 4, "PLACE"), (9, 11, "PLACE")]}),
        ("「見立八景之内」  「清水寺の晩鐘」「清玄阿闍梨」「入間の息女桜姫」", {"entities": [(11, 14, "PLACE")]}),
        (" 「江戸自慢三十六興」  「落合　ほたる」", {"entities": [(2, 4, "PLACE"), (14, 16, "PLACE")]}),
        (" 「曽我八景自筆鏡」  「十郎祐成」「曽我中村」", {"entities": [(2, 4, "PLACE")]}),
        (" 「東海道五十三次之内」  「御油」「其二」「山本勘助母」", {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE")]}),
        ("「東海道」「大津三井寺」", {"entities": [(1, 4, "PLACE"), (6, 11, "PLACE")]}),
        ("「王城加茂社風景」", {"entities": [(3, 6, "PLACE")]}),
        (
            "「東海道名所之内」  「深草乃里」「少将つか」「せう／＼さくら」「元政寺」",
            {"entities": [(1, 4, "PLACE"), (12, 16, "PLACE"), (33, 36, "PLACE")]}),
        ("「東海道名所之内」  「淀川」", {"entities": [(1, 4, "PLACE"), (12, 14, "PLACE")]}),
        ("「東京三芝居町繁栄之図」", {"entities": [(1, 3, "PLACE"), (4, 6, "PLACE")]}),
        ("「津島牛頭天王」「舟発場」「佐屋川」「本陣」", {"entities": [(1, 3, "PLACE"), (14, 17, "PLACE"), (19, 21, "PLACE")]}),
        (" 「東海道」  「浜松」", {"entities": [(2, 5, "PLACE"), (9, 11, "PLACE")]}),
        (" 「東海道之内」  「岡部」", {"entities": [(2, 5, "PLACE"), (11, 13, "PLACE")]}),
        (" 「東海道名所之内」  「豊川」", {"entities": [(2, 5, "PLACE"), (13, 15, "PLACE")]}),
        ("［川口善光寺開帳参詣之図］", {"entities": [(1, 6, "PLACE")]}),
        (" 「東海道」  「島田」", {"entities": [(2, 5, "PLACE"), (9, 11, "PLACE")]}),
        ("「浅草金竜山之図」", {"entities": [(1, 6, "PLACE")]}),
        ("「東京名所の内」  「浅草区金竜山浅草寺境内一覧」", {"entities": [(1, 3, "PLACE"), (11, 20, "PLACE")]}),
        (" 「しん板車づくし」  「横浜鉄道図」", {"entities": [(13, 15, "PLACE")]}),
        (" 「東都名所高輪行粧之図」", {"entities": [(2, 4, "PLACE"), (6, 8, "PLACE")]}),
        (" 「東都名所」  「隅田川花盛」", {"entities": [(2, 4, "PLACE"), (10, 13, "PLACE")]}),
        (" 「江戸の花名勝会」  「り」「十番組」「一ツ家の賤の女　尾上菊次郎」「浅茅が原衣掛松」",
         {"entities": [(2, 4, "PLACE"), (36, 40, "PLACE")]}),
        ("「江戸の花名勝会」  「ち」「十番組」「一ツ家の姥　市川海老蔵」「猿若芝居町」",
         {"entities": [(1, 3, "PLACE"), (33, 38, "PLACE")]}),
        (" 「東京三十六景」  「十五」「両国」「十六」「本所一ツ目之橋」",
         {"entities": [(2, 4, "PLACE"), (16, 18, "PLACE"), (26, 31, "PLACE")]}),
        (" 「東京十二月之内」  「二月」「亀井戸天神」「亀井戸梅林」",
         {"entities": [(2, 4, "PLACE"), (17, 22, "PLACE"), (24, 29, "PLACE")]}),
        (" 「東京十二月之内」  「四月」「品川沖之景」", {"entities": [(2, 4, "PLACE"), (17, 19, "PLACE")]}),
        (" 「東京十二月之内」  「六月」「愛宕之景」「神田神社」",
         {"entities": [(2, 4, "PLACE"), (17, 19, "PLACE"), (23, 27, "PLACE")]}),
        ("「東京開化名所」  「三代徳川家光公」「三河島之景」", {"entities": [(1, 3, "PLACE"), (20, 23, "PLACE")]}),
        (" 「東京名所競」  「上野東照宮」", {"entities": [(2, 4, "PLACE"), (11, 16, "PLACE")]}),
        ("「東京銘勝会」  「不忍の競馬」", {"entities": [(1, 3, "PLACE"), (10, 15, "PLACE")]}),
        (" 「東海道」  「土山」「鈴ヶ山坂ノ下」", {"entities": [(2, 5, "PLACE"), (9, 11, "PLACE"), (13, 19, "PLACE")]}),
        ("「堀切花菖蒲」", {"entities": [(1, 6, "PLACE")]}),
        (" 「両国花火之図」", {"entities": [(2, 4, "PLACE")]}),
        (" 「亀戸梅屋敷」", {"entities": [(1, 6, "PLACE")]}),
        ("「東京十二月之内」  「一月」「宮城之春」「九段坂」",
         {"entities": [(1, 3, "PLACE"), (16, 20, "PLACE"), (24, 27, "PLACE")]}),
        (" 「見立十二支」  「丑」「向島」「牛島神社」", {"entities": [(14, 16, "PLACE"), (18, 22, "PLACE")]}),
        ("「見立十二支」  「辰」「深川八幡」「富士」", {"entities": [(13, 17, "PLACE"), (19, 21, "PLACE")]}),
        (" 「見立十二支」  「酉」「浅草田甫酉の市」", {"entities": [(14, 18, "PLACE")]}),
        (" 「東海道五拾三次之内」  「大尾」「京師」「三条大橋」",
         {"entities": [(2, 5, "PLACE"), (19, 21, "PLACE"), (23, 27, "PLACE")]}),
        (" 「東海道五拾三次之内」  「日本橋」「行烈振出」", {"entities": [(2, 5, "PLACE"), (15, 18, "PLACE")]}),
        (" 「東海道五拾三次之内」  「四日市」「三重川」",
         {"entities": [(2, 5, "PLACE"), (15, 18, "PLACE"), (20, 23, "PLACE")]}),
        (" 「東海道五拾三次之内」  「大津」「走井茶屋」",
         {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE"), (19, 21, "PLACE")]}),
        (
        " 「東海道五拾三次之内」  「平塚」「縄手道」", {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE"), (19, 22, "PLACE")]}),
        (" 「東海道五拾三次之内」  「土山」「春之雨」", {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE")]}),
        (" 「東海道五拾三次之内」  「日坂」「佐夜ノ中山」",
         {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE"), (19, 24, "PLACE")]}),
        ("「東海道五拾三次之内」  「庄野」「白雨」", {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE")]}),
        (" 「江戸名所」  「両国花火」", {"entities": [(2, 4, "PLACE"), (10, 12, "PLACE")]}),
        (" 「江戸名所」  「芝増上寺前の景」", {"entities": [(2, 4, "PLACE"), (11, 14, "PLACE")]}),
        (" 「東都名所」  「新吉原五丁町弥生花盛全図」", {"entities": [(2, 4, "PLACE"), (10, 16, "PLACE")]}),
        (" 「東海道五拾三次之内」  「袋井」「出茶屋ノ図」",
         {"entities": [(2, 5, "PLACE"), (15, 17, "PLACE"), (19, 22, "PLACE")]}),
        ("［江都名所浅草観音の図］", {"entities": [(1, 3, "PLACE"), (5, 9, "PLACE")]}),
        ("「東京市中馬車往来之図」", {"entities": [(1, 3, "PLACE")]}),
        ("［東京海運橋兜町為換座五階造リ図］", {"entities": [(1, 8, "PLACE")]}),
        ("［久松町劇場久松座繁栄図］", {"entities": [(1, 4, "PLACE")]}),
        ("「東京名所」  「スジカイ　万代橋」", {"entities": [(1, 3, "PLACE"), (14, 17, "PLACE")]}),
        ("「東京名所之内」  「高輪海岸鉄道の図」", {"entities": [(1, 3, "PLACE"), (11, 15, "PLACE")]}),
        (
        " 「東海道五拾三次之内」  「原」「朝之富士」", {"entities": [(2, 5, "PLACE"), (15, 16, "PLACE"), (20, 22, "PLACE")]}),
        ("「横浜名所図会」  「野毛山下蒸気車」", {"entities": [(1, 3, "PLACE"), (11, 14, "PLACE")]}),
        ("「東京名所之内」  「上野公園清水堂」", {"entities": [(1, 3, "PLACE"), (11, 18, "PLACE")]}),
        ("「東海道五拾三次之内」  「見附」「天竜川図」",
         {"entities": [(1, 4, "PLACE"), (14, 16, "PLACE"), (18, 22, "PLACE")]}),
        ("「東京開化三十六景」  「柳橋より浅草橋」", {"entities": [(1, 3, "PLACE"), (13, 15, "PLACE"), (17, 20, "PLACE")]}),
        ("「東京名所之内」  「浅草金竜山」", {"entities": [(1, 3, "PLACE"), (11, 16, "PLACE")]}),
        (
            "「伊勢名所」「伊勢土産名所図画」  「二見浦之景」「賓日館及海水景」「六」",
            {"entities": [(1, 3, "PLACE"), (19, 22, "PLACE"), (26, 32, "PLACE")]}),
        ("「大和名所」  「大仏殿」", {"entities": [(1, 3, "PLACE"), (10, 13, "PLACE")]}),
        ("「大和名所」  「春日神社」「若草山」", {"entities": [(1, 3, "PLACE"), (9, 13, "PLACE"), (15, 18, "PLACE")]}),
        (
            "「府県名所図会」  「兵庫県」「神戸布引滝」「県庁之位地　八部郡神戸」",
            {"entities": [(11, 14, "PLACE"), (16, 21, "PLACE"), (29, 34, "PLACE")]}),
        (" 「神田御社眺望」", {"entities": [(2, 6, "PLACE")]}),
        (" 「大阪名所」  「桜乃宮より造幣局を望む」「天神橋之図」「造幣局」",
         {"entities": [(2, 4, "PLACE"), (10, 13, "PLACE"), (23, 26, "PLACE"), (30, 33, "PLACE")]}),
        (" 「東海道之内」  「関」", {"entities": [(2, 5, "PLACE")]}),
        ("「観音霊験記」  「秩父順礼廿九番」「笹の戸　見目山　長泉院」", {"entities": [(19, 30, "PLACE")]}),
        ("［東京三井組ハウス］", {"entities": [(1, 9, "PLACE")]}),
        ("「東京名所　浅草観音之図」", {"entities": [(1, 3, "PLACE"), (6, 10, "PLACE")]}),
        (" 「名所江戸百景」  「鎧の渡し　小網町」", {"entities": [(4, 6, "PLACE"), (16, 20, "PLACE")]}),
        ("「諸国滝廻リ」  「木曽海道　小野ノ瀑布」", {"entities": [(10, 14, "PLACE")]}),
        ("「五十三次名所図会」「丗二」  「あら井　渡舟着岸御関所」", {"entities": [(17, 20, "PLACE")]}),
        ("「五十三次名所図会　四十」「池鯉鮒　八ツ橋むら　杜若の古せき」", {"entities": [(14, 23, "PLACE")]}),
        ("「五十三次名所図会」「丗八」  「藤川　山中の里別名宮路山」",
         {"entities": [(17, 19, "PLACE"), (20, 24, "PLACE"), (26, 29, "PLACE")]}),
        ("「川崎」  「神奈川へ二リ半」", {"entities": [(1, 3, "PLACE"), (7, 10, "PLACE")]}),
        ("「江都名所」  「洲崎しほ干狩」", {"entities": [(1, 3, "PLACE"), (9, 11, "PLACE")]}),
        ("「諸国名橋奇覧」  「摂州安治川口天保山」", {"entities": [(11, 20, "PLACE")]}),
        ("「東都名所」  「永代橋深川新地」", {"entities": [(1, 3, "PLACE"), (9, 16, "PLACE")]}),
        ("「五十三次名所図会」「一」  「日本橋　東雲の景", {"entities": [(17, 20, "PLACE")]}),
        ("「五十三次名所図会」「六」  「戸塚山道より不二眺望」", {"entities": [(16, 20, "PLACE"), (22, 24, "PLACE")]}),
        ("「富士三十六景」  「東都佃沖」", {"entities": [(1, 3, "PLACE"), (11, 14, "PLACE")]}),
        ("「江戸名所之内」  「真乳山」", {"entities": [(1, 3, "PLACE"), (11, 14, "PLACE")]}),
        ("「名所江戸百景」  「千住の大はし」", {"entities": [(3, 5, "PLACE"), (11, 17, "PLACE")]}),
        ("「諸国名所百景」  「遠州秋葉遠景袋井凧」", {"entities": [(13, 15, "PLACE"), (17, 19, "PLACE")]})
        ]


######################################################################
def create_df_from_list(List_Set):
    list_title = []
    list_pos_tags = []
    for entity in List_Set:
        ### Title ###
        text = entity[0]
        list_title.append(text)  # eg.'朝食にを焼いて食べまし[MASK]。'

        ### Tags ###
        tags = entity[1]['entities']
        list_pos_tags.append(tags)

    # Create DataFrame
    df = pd.DataFrame({'title': list_title,
                       'entities': list_pos_tags,
                       })
    print(df)
    return df


def add_column_with_metadata(df_train, df_test):
    """
    Add metadata in the column from another file
    """

    train_data = pd.read_excel('train.xlsx')
    test_data = pd.read_excel('test.xlsx')

    for column_name in ["Genre", "Artist", "Image URL", "Permalink"]:
        df_train[column_name] = train_data[column_name]
        df_test[column_name] = test_data[column_name]

    return df_train, df_test


if __name__ == "__main__":
    df_train = create_df_from_list(List_Set=Train)
    df_test = create_df_from_list(List_Set=Test)

    df_train, df_test = add_column_with_metadata(df_train, df_test)

    df_train.to_csv("../train_place.csv", index=False)
    df_test.to_csv("../test_place.csv", index=False)
